// // Дана переменная Х, которая может принимать любое значение. 
// Написать программу, которая в зависимости от типа данных Х выводит в консоль 
// сообщение вида: «X — число».
// // Опишите три случая: когда х = числу, строке или логическому типу. 
// В других случаях выводите сообщение: «Тип x не определён».

//done

let x = 3;

if(typeof x == "number") {
    console.log(`${x}` + "- number value");
} else if(typeof x == "string") {
    console.log(`${x}` + "- string value");
} else if(typeof x == "boolean") {
    console.log(`${x}` + "- boolean value");
 }
